[
  {
    "title": "Light Bringer - A Red Rising Novel",
    "id": 41,
    "price": 2399,
    "thumbnailUrl": "https://covers3.booksamillion.com/covers/bam/0/42/528/597/0425285979_b.jpg",
    "longDescription": "Darrow returns as Pierce Brown's New York Times bestselling Red Rising series continues in the thrilling sequel to Dark Age. \"Brown's plots are like a depth charge of nitromethane dropped in a bucket of gasoline. His pacing is 100% him standing over it all with a lit match and a smile, waiting for us to dare him to drop it.\"--NPR, on Dark Age. \"The measure of a man is not the fear he sows in his enemies. It is the hope he gives his friends.\"--Virginia au Augustus The Reaper is a legend, more myth than man: the savior of worlds, the leader of the Rising, the breaker of chains. But the Reaper is also Darrow, born of the red soil of Mars: a husband, a father, a friend. The worlds once needed the Reaper. But now they need Darrow. Because after the dark age will come a new age: of light, of victory, of hope. Don't miss any of Pierce Brown's Red Rising Saga: RED RISING - GOLDEN SON - MORNING STAR - IRON GOLD - DARK AGE - LIGHT BRINGER",
    "authors": ["Pierce Brown"],
    "categories": ["Carousel"]
  },
  {
    "title": "Baking Yesteryear : The Best Recipes from the 1900s to the 1980s",
    "id": 42,
    "price": 1999,
    "thumbnailUrl": "https://covers2.booksamillion.com/covers/bam/0/74/408/004/0744080045.jpg",
    "longDescription": "A decade-by-decade cookbook that highlights the best (and a few of the worst) baking recipes from the 20th century Friends of baking, are you sick and tired of making the same recipes again and again? Then look no further than this baking blast from the past, as B. Dylan Hollis highlights the most unique tasty treats of yesteryear. Travel back in time on a delicious decade-by-decade jaunt as Dylan shows you how to bake vintage forgotten greats. With a big pinch of fun and a full cup of humor, you'll be baking everything from Chocolate Potato Cake from the 1910s to Avocado Pie from the 1960s. Dylan has baked hundreds of recipes from countless antique cookbooks and selected only the best for this bakebook, sharing the shining stars from each decade. And because some of the recipes Dylan shares on his wildly popular social media channels are spectacular failures, he's thrown in a few of the most disastrously strange recipes for you to try if you dare. A few of Dylan's favorites that are going to have you licking your lips and begging for more include:\n● 1900s Cornflake Macaroons\n● 1910s ANZAC Biscuits\n● 1930s Peanut Butter Bread\n● 1940s Chocolate Sauerkraut Cake\n● 1950s Tomato Soup Cake\n● 1970s Potato Chip Cookies Baking Yesteryear contains 101 expertly curated recipes that will take you on a delicious journey through the past. With a larger-than-life personality and comedic puns galore, baking with Dylan never gets old. We'll leave that to the recipes.",
    "authors": ["B. Dylan Hollis"],
    "categories": ["Carousel"]
  },
  {
    "title": "Divine Rivals",
    "id": 43,
    "price": 1300,
    "thumbnailUrl": "https://covers4.booksamillion.com/covers/bam/1/25/085/743/1250857430_b.jpg",
    "longDescription": "When two young rival journalists find love through a magical connection, they must face the depths of hell, in a war among gods, to seal their fate forever.\n\nAfter centuries of sleep, the gods are warring again. But eighteen-year-old Iris Winnow just wants to hold her family together. Her mother is suffering from addiction and her brother is missing from the front lines. Her best bet is to win the columnist promotion at the Oath Gazette. To combat her worries, Iris writes letters to her brother and slips them beneath her wardrobe door, where they vanish--into the hands of Roman Kitt, her cold and handsome rival at the paper. When he anonymously writes Iris back, the two of them forge a connection that will follow Iris all the way to the front lines of battle: for her brother, the fate of mankind, and love. Shadow and Bone meets Lore in Rebecca Ross's Divine Rivals, an epic enemies-to-lovers fantasy novel filled with hope and heartbreak, and the unparalleled power of love.",
    "authors": ["Rebecca Ross"],
    "categories": ["Carousel"]
  },
  {
    "title": "A Thousand Boy Kisses",
    "id": 44,
    "price": 1099,
    "thumbnailUrl": "https://covers1.booksamillion.com/covers/bam/1/72/829/708/1728297087_b.jpg",
    "longDescription": "He kissed me until there was no part of me that didn't know who it belonged to. He kissed me until my heart again fused with his--two halves of one whole.\n\nOne kiss lasts a moment. But a thousand kisses can last a lifetime.\n\nOne boy. One girl. A bond that is forged in an instant and cherished for a decade. A bond that neither time nor distance can break. A bond that will last forever.\n\nOr so they believe.\n\nWhen seventeen-year-old Rune Kristiansen returns from his native Norway to the sleepy town of Blossom Grove, Georgia, where he befriended Poppy Litchfield as a child, he has just one thing on his mind. Why did the girl who was one half of his soul, who promised to wait faithfully for his return, cut him off without a word of explanation?\n\nRune's heart was broken two years ago when Poppy fell silent. But when he discovers the truth of her absence, he finds that the greatest heartache is yet to come.\n\nThis Bloom edition includes a special bonus epilogue.",
    "authors": ["Tillie Cole"],
    "categories": ["Carousel"]
  }
]
